# Task-2 Create a data frame using labelencoder and onehotencoder and converting categorical data to numerical data

In [1]:
!pip install --user scikit-learn

Requirement already satisfied: scikit-learn in c:\programdata\anaconda3\lib\site-packages (0.23.1)
Requirement already satisfied: joblib>=0.11 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (0.16.0)
Requirement already satisfied: numpy>=1.13.3 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (1.18.5)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (2.1.0)
Requirement already satisfied: scipy>=0.19.1 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (1.5.0)

In [2]:
import numpy as np
import pandas as pd

In [4]:
data =['sai','usha','ram','teja','gopi']
num =[27, 24, 22, 26,25]
Add= ['Delhi', 'Hyd', 'vizag', 'chennai','mysore']

data = {'Name':data,'Age':num,'Address':Add}
print(data)
df = pd.DataFrame(data)
df

{'Name': ['sai', 'usha', 'ram', 'teja', 'gopi'], 'Age': [27, 24, 22, 26, 25], 'Address': ['Delhi', 'Hyd', 'vizag', 'chennai', 'mysore']}

   Name  Age  Address
0   sai   27    Delhi
1  usha   24      Hyd
2   ram   22    vizag
3  teja   26  chennai
4  gopi   25   mysore

In [5]:
df=df.iloc[:,:].values
df

array([['sai', 27, 'Delhi'],
       ['usha', 24, 'Hyd'],
       ['ram', 22, 'vizag'],
       ['teja', 26, 'chennai'],
       ['gopi', 25, 'mysore']], dtype=object)

In [6]:
from sklearn.preprocessing import LabelEncoder
Name=LabelEncoder()
df[:,0]=Name.fit_transform(df[:,0])
df

array([[2, 27, 'Delhi'],
       [4, 24, 'Hyd'],
       [1, 22, 'vizag'],
       [3, 26, 'chennai'],
       [0, 25, 'mysore']], dtype=object)

In [14]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder
ct =ColumnTransformer(transformers=[('encode',OneHotEncoder(),[0])],remainder="passthrough")

In [15]:
y=ct.fit_transform(df)
df=pd.DataFrame(y)
df

   0  1  2  3  4   5        6
0  0  0  1  0  0  27    Delhi
1  0  0  0  0  1  24      Hyd
2  0  1  0  0  0  22    vizag
3  0  0  0  1  0  26  chennai
4  1  0  0  0  0  25   mysore